app/views/drinks/_form.html.erb

    <%= form.label :drink_category_id %>
    <%= form.collection_select(:drink_category_id, DrinkCategory.all, :id, :name) %>
---
SELECT "drink_categories".* FROM "drink_categories"