app/controllers/drinks_controller.rb

INSERT INTO "drinks" ("name", "price", "drink_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Vesper"], ["price", 20], ["drink_category_id", 6], ["created_at", "2017-08-20 22:57:15.487671"], ["updated_at", "2017-08-20 22:57:15.487671"]]
---
  def create
  	@drink = Drink.new(drink_params)

  	if @drink.save

UPDATE "drinks" SET "drink_category_id" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["drink_category_id", 1], ["updated_at", "2017-08-20 23:14:34.911909"], ["id", 1]]
---
  def update
    @drink.update(drink_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  	def find_drinks
  		@drink = Drink.find(params[:id])