app/controllers/drink_categories_controller.rb

  def index
    @drink_categories = DrinkCategory.all
---
SELECT "drink_categories".* FROM "drink_categories"

  def create

    @drink_category = DrinkCategory.new(category_params)

    if @drink_category.save
---
INSERT INTO "drink_categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Whiskey"], ["created_at", "2017-08-20 22:51:25.370645"], ["updated_at", "2017-08-20 22:51:25.370645"]]